; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-63)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l1)
    (at p2 l12)
    (at p3 l3)
    (at p4 l1)
    (at p5 l3)
    (at p6 l2)
    (at p7 l3)
    (at p8 l2)
    (at p9 l2)
    (at p10 l11)
    (at p11 l6)
    (at v1 l6)
    (at v2 l11)
    (at v3 l1)
    (at v4 l4)
    (at v5 l10)
    (road l9 l2)
    (road l3 l10)
    (road l11 l2)
    (road l8 l9)
    (road l9 l8)
    (road l10 l3)
    (road l2 l11)
    (road l4 l2)
    (road l5 l3)
    (road l10 l2)
    (road l11 l7)
    (road l2 l4)
    (road l1 l2)
    (road l2 l1)
    (road l2 l10)
    (road l12 l11)
    (road l3 l5)
    (road l9 l6)
    (road l11 l12)
    (road l2 l9)
    (road l7 l11)
    (road l6 l9)
    (road l5 l11)
    (road l11 l5)
    (road l7 l8)
    (road l8 l7)
    (road l3 l6)
    (road l6 l3)
    (road l5 l6)
    (road l6 l5)
    (road l4 l8)
    (road l8 l4)
    (road l7 l9)
    (road l9 l7)
    (road l10 l12)
    (road l12 l10)
    (road l3 l9)
    (road l9 l3)
    (road l4 l10)
    (road l10 l4)
    (road l3 l7)
    (road l7 l3)
    (road l8 l12)
    (road l12 l8)
    (road l4 l9)
    (road l9 l4)
    (road l6 l11)
    (road l11 l6)
    (road l3 l4)
    (road l4 l3)
    (road l2 l3)
    (road l3 l2)
    (road l2 l7)
    (road l7 l2)
    (road l2 l12)
    (road l12 l2)
    (road l9 l12)
    (road l12 l9)
    (road l1 l6)
    (road l6 l1)
    (road l1 l10)
    (road l10 l1)
    (road l4 l5)
    (road l5 l4)
    (road l1 l3)
    (road l3 l1)
    (road l4 l7)
    (road l7 l4)
    (road l10 l11)
    (road l11 l10)
    (road l1 l4)
    (road l4 l1)
    (road l5 l7)
    (road l7 l5)
    )
 (:goal (and 
(at p1 l10)
(at p2 l1)
(at p3 l5)
(at p4 l4)
(at p5 l8)
(at p6 l8)
(at p7 l2)
))
)

; plan
1. (drive v4 l4 l3)
   deleted: (at v4 l4)
   added: (at v4 l3)
   goals met: 0 of 7
2. (pick-up v4 l3 p3 c1 c2)
   deleted: (at p3 l3) (capacity v4 c2)
   added: (in p3 v4) (capacity v4 c1)
   goals met: 0 of 7
3. (pick-up v4 l3 p7 c0 c1)
   deleted: (at p7 l3) (capacity v4 c1)
   added: (in p7 v4) (capacity v4 c0)
   goals met: 0 of 7
4. (drive v4 l3 l5)
   deleted: (at v4 l3)
   added: (at v4 l5)
   goals met: 0 of 7
5. (drop v4 l5 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l5) (capacity v4 c1)
   goals met: 1 of 7
6. (pick-up v3 l1 p1 c0 c1)
   deleted: (at p1 l1) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 1 of 7
7. (drive v3 l1 l10)
   deleted: (at v3 l1)
   added: (at v3 l10)
   goals met: 1 of 7
8. (drop v3 l10 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l10) (capacity v3 c1)
   goals met: 2 of 7
9. (drive v4 l5 l3)
   deleted: (at v4 l5)
   added: (at v4 l3)
   goals met: 2 of 7
10. (pick-up v4 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v4 c1)
   added: (in p5 v4) (capacity v4 c0)
   goals met: 2 of 7
11. (drive v4 l3 l2)
   deleted: (at v4 l3)
   added: (at v4 l2)
   goals met: 2 of 7
12. (drop v4 l2 p7 c0 c1)
   deleted: (in p7 v4) (capacity v4 c0)
   added: (at p7 l2) (capacity v4 c1)
   goals met: 3 of 7
13. (pick-up v4 l2 p6 c0 c1)
   deleted: (at p6 l2) (capacity v4 c1)
   added: (in p6 v4) (capacity v4 c0)
   goals met: 3 of 7
14. (drive v4 l2 l12)
   deleted: (at v4 l2)
   added: (at v4 l12)
   goals met: 3 of 7
15. (drive v4 l12 l8)
   deleted: (at v4 l12)
   added: (at v4 l8)
   goals met: 3 of 7
16. (drop v4 l8 p5 c0 c1)
   deleted: (in p5 v4) (capacity v4 c0)
   added: (at p5 l8) (capacity v4 c1)
   goals met: 4 of 7
17. (drop v4 l8 p6 c1 c2)
   deleted: (in p6 v4) (capacity v4 c1)
   added: (at p6 l8) (capacity v4 c2)
   goals met: 5 of 7
18. (drive v4 l8 l12)
   deleted: (at v4 l8)
   added: (at v4 l12)
   goals met: 5 of 7
19. (pick-up v4 l12 p2 c1 c2)
   deleted: (at p2 l12) (capacity v4 c2)
   added: (in p2 v4) (capacity v4 c1)
   goals met: 5 of 7
20. (drive v4 l12 l10)
   deleted: (at v4 l12)
   added: (at v4 l10)
   goals met: 5 of 7
21. (drive v4 l10 l1)
   deleted: (at v4 l10)
   added: (at v4 l1)
   goals met: 5 of 7
22. (drop v4 l1 p2 c1 c2)
   deleted: (in p2 v4) (capacity v4 c1)
   added: (at p2 l1) (capacity v4 c2)
   goals met: 6 of 7
23. (pick-up v4 l1 p4 c1 c2)
   deleted: (at p4 l1) (capacity v4 c2)
   added: (in p4 v4) (capacity v4 c1)
   goals met: 6 of 7
24. (drive v4 l1 l4)
   deleted: (at v4 l1)
   added: (at v4 l4)
   goals met: 6 of 7
25. (drop v4 l4 p4 c1 c2)
   deleted: (in p4 v4) (capacity v4 c1)
   added: (at p4 l4) (capacity v4 c2)
   goals met: 7 of 7
